#include "button_proc.h"
#include "button_periph.h"

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------

void button_init(void)
{
    PORTA_init ();
    TIM2_init ();  
}

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------

//переменная для отслеживания состояния кнопки
__IO uint8_t ButtonFlag = 0;							//флаг кнопки. 0 - отжата. 1 - нажата

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------

void TIM2_IRQHandler (void)							//обработчик прерывания от TIM2
{
    CLEAR_BIT(TIM2->SR, TIM_SR_UIF);					        //сброс флага таймера TIM2    
    button_press_tracking ();    	
}

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------

void button_press_tracking (void)
{
    static uint8_t ButtonCount = 0;                                             //переменная счетчика кнопки

    if (read_button_state ())				                        		
    {	
      ButtonCount = 0;						                //если кнопка не нажата . Сброс счетчика кнопки	
    }	
    else									//иначе кнопка нажата.   		
    {		
      if (ButtonCount < 5)						        //для отработки нажатия кнопки, она должна быть нажата в течении 50мс
      {
        ButtonCount++;						                //Инкрементируем счетчик кнопки		
        
        if (ButtonCount == 5)					                //если кнопка нажата и нет дребезга в течении 50мс
        {		
         ButtonFlag = 1;				                        //поднимаем флаг нажатия кнопки			
        }		
      }				
    }
}

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------

uint8_t track_button_press_again (void)
{ 
  static uint8_t ButtonPress = 0;
  
  if (ButtonFlag)								
  {	
    ButtonPress++;								
    ButtonFlag = 0;								//сброс флага нажатия кнопки
																																	
    if (ButtonPress > 1)		                                        //если нажали кнопку повторно
    {
      ButtonPress = 0;								//сбросить счётчик нажатий
    }
   }
  
  return ButtonPress;
} 

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------
