#include "led_proc.h"
#include "led_init.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------

#define LED_ON          SET_BIT (GPIOB->BSRR, GPIO_BSRR_BS2)
#define LED_OFF         SET_BIT(GPIOB->BSRR, GPIO_BSRR_BR2)
#define PIN5_HIGH       SET_BIT (GPIOB->BSRR, GPIO_BSRR_BS5)
#define PIN5_LOW        SET_BIT(GPIOB->BSRR, GPIO_BSRR_BR5)
#define TIM3_ON         SET_BIT (TIM3->CR1,TIM_CR1_CEN)				    
#define TIM3_OFF        CLEAR_BIT (TIM3->CR1,TIM_CR1_CEN)                     

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------

void led_init(void) 
{
  PORTB_init();
  TIM3_init ();
}

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------

void TIM3_IRQHandler (void)							//обработчик прерывания от TIM3
{
    CLEAR_BIT(TIM3->SR, TIM_SR_UIF);			                        //сброс флага таймера TIM3
    LED_blink ();	
}

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------

void LED_blink (void)
{
      if (READ_BIT(GPIOB->IDR, GPIO_IDR_IDR2))					//чтение значения PortB2, если LED On - тушим его
      {										
        LED_OFF;					
        PIN5_LOW;					
      }
      else
      {																
        LED_ON;					
        PIN5_HIGH;					
      }
}

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------
 
extern uint8_t button_state;

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------

void LED_blink_on_off (uint8_t button_state)
{
    if (button_state)
    {
      TIM3_ON;
    }
    else
    {
      TIM3_OFF; 
      LED_OFF;					
      PIN5_LOW;
    }
}

//-----------------------------------------------------------------------------
//
//-----------------------------------------------------------------------------